dunst/dunstrc
# Globals

# [[file:README.org::*Globals][Globals:1]]
[global]
# Globals:1 ends here

# Colors

# [[file:README.org::*Colors][Colors:1]]
    frame_color = "#2E3440"
    separator_color = "#44475a"
# Colors:1 ends here

# Font

# [[file:README.org::*Font][Font:1]]
    font = SauceCodePro Nerd Font 10
# Font:1 ends here

# Size
# The geometry of the window:
# #+BEGIN_EXAMPLE
#    [{width}]x{height}[+/-{x}+/-{y}]
# #+END_EXAMPLE

# [[file:README.org::*Size][Size:1]]
    frame_width = 1
    geometry = "500x4-25+25"
# Size:1 ends here

# Message format
# The format of the message.  Possible variables are:
# #+BEGIN_EXAMPLE
# %a  appname
# %s  summary
# %b  body
# %i  iconname (including its path)
# %I  iconname (without its path)
# %p  progress value if set ([  0%] to [100%]) or nothing
# #+END_EXAMPLE

# [[file:README.org::*Message format][Message format:1]]
    format = "%a\n<b>%s </b>%p\n%b"
# Message format:1 ends here

# Use markup
# Allow a small subset of html markup:
# #+BEGIN_EXAMPLE
#   <b>bold</b>
#   <i>italic</i>
#   <s>strikethrough</s>
#   <u>underline</u>

# #+END_EXAMPLE
# [[http://developer.gnome.org/pango/stable/PangoMarkupFormat.html][complete reference]]

# [[file:README.org::*Use markup][Use markup:1]]
    markup = yes
# Use markup:1 ends here

# Sorting
# Sort messages by urgency.

# [[file:README.org::*Sorting][Sorting:1]]
    sort = yes
# Sorting:1 ends here

# Shrink
# Shrink window if it's smaller than the width.

# [[file:README.org::*Shrink][Shrink:1]]
    shrink = yes
# Shrink:1 ends here

# Indicate hidden
# Show how many messages are currently hidden

# [[file:README.org::*Indicate hidden][Indicate hidden:1]]
    indicate_hidden = yes
# Indicate hidden:1 ends here

# Notification on active screen
# Display notification on focused monitor.

# [[file:README.org::*Notification on active screen][Notification on active screen:1]]
    follow = keyboard
# Notification on active screen:1 ends here

# Idle Threshold
# Don't remove messages, if the user is idle (no mouse or keyboard input) for
# longer than idle_threshold seconds. Set to 0 to disable.

# [[file:README.org::*Idle Threshold][Idle Threshold:1]]
    idle_threshold = 120
# Idle Threshold:1 ends here

# Show indicators
# Display indicators for URLs (U) and actions (A).

# [[file:README.org::*Show indicators][Show indicators:1]]
    show_indicators = yes
# Show indicators:1 ends here

# Padding
# Padding between text and separator / border of box

# [[file:README.org::*Padding][Padding:1]]
    padding = 8
    horizontal_padding = 10
# Padding:1 ends here

# Startup Notification
# Print a notification on startup (mainly for error detection)

# [[file:README.org::*Startup Notification][Startup Notification:1]]
    startup_notification = false
# Startup Notification:1 ends here

# Misc

# [[file:README.org::*Misc][Misc:1]]
    alignment = left
    word_wrap = yes
    ignore_newline = no
    show_age_threshold = -1
    transparency = 05
    line_height = 0
    separator_height = 1
    padding = 8
    horizontal_padding = 10
# Misc:1 ends here

# History length
# Maximum amount of notifications kept in history

# [[file:README.org::*History length][History length:1]]
    history_length = 20
# History length:1 ends here

# Sticky History
# Should a notification popped up from history be sticky or timeout
# as if it would normally do.

# [[file:README.org::*Sticky History][Sticky History:1]]
    sticky_history = yes
# Sticky History:1 ends here

# Urgency Low

# [[file:README.org::*Urgency Low][Urgency Low:1]]
[urgency_low]
    background = "#2E3440"
    foreground = "#4C566A"
# Urgency Low:1 ends here

# Timeout
# Display message for 3 seconds

# [[file:README.org::*Timeout][Timeout:1]]
    timeout = 3
# Timeout:1 ends here

# Urgency Normal

# [[file:README.org::*Urgency Normal][Urgency Normal:1]]
[urgency_normal]
    background = "#2E3440"
    foreground = "#D8DEE9"
# Urgency Normal:1 ends here

# Timeout
# Display message for 5 seconds

# [[file:README.org::*Timeout][Timeout:1]]
    timeout = 5
# Timeout:1 ends here

# Urgency Critical

# [[file:README.org::*Urgency Critical][Urgency Critical:1]]
[urgency_critical]
    background = "#2E3440"
    foreground = "#BF616A"
# Urgency Critical:1 ends here

# Timeout
# Display message until dismissed.

# [[file:README.org::*Timeout][Timeout:1]]
    timeout = 0
# Timeout:1 ends here
